benchmarks/nginx_2023-01-29T05:26:29+05:30/hfi.log
----0kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /0kb
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1806694
Failed requests:        0
Keep-Alive requests:    1806694
Total transferred:      449866806 bytes
HTML transferred:       0 bytes
Requests per second:    30111.56 [#/sec] (mean)
Time per request:       3.321 [ms] (mean)
Time per request:       0.033 [ms] (mean, across all concurrent requests)
Transfer rate:          7322.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.7      0     253
Processing:     0    3   0.5      3     204
Waiting:        0    3   0.5      3     204
Total:          0    3   1.7      3     253

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      3
  98%      3
  99%      3
 100%    253 (longest request)
----1kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /1kb
Document Length:        1024 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1754108
Failed requests:        0
Keep-Alive requests:    1754108
Total transferred:      2241750024 bytes
HTML transferred:       1796206592 bytes
Requests per second:    29235.12 [#/sec] (mean)
Time per request:       3.421 [ms] (mean)
Time per request:       0.034 [ms] (mean, across all concurrent requests)
Transfer rate:          36486.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0     252
Processing:     0    3   0.6      3     176
Waiting:        0    3   0.6      3     176
Total:          0    3   1.7      3     252

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      3
  98%      4
  99%      4
 100%    252 (longest request)
----2kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /2kb
Document Length:        2048 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1673857
Failed requests:        0
Keep-Alive requests:    1673857
Total transferred:      3853218814 bytes
HTML transferred:       3428059136 bytes
Requests per second:    27897.60 [#/sec] (mean)
Time per request:       3.585 [ms] (mean)
Time per request:       0.036 [ms] (mean, across all concurrent requests)
Transfer rate:          62715.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.7      0     254
Processing:     0    4   0.6      4     177
Waiting:        0    4   0.6      4     177
Total:          0    4   1.8      4     254

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      4
  99%      4
 100%    254 (longest request)
----4kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /4kb
Document Length:        4096 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1627251
Failed requests:        0
Keep-Alive requests:    1627251
Total transferred:      7080169101 bytes
HTML transferred:       6665220096 bytes
Requests per second:    27120.83 [#/sec] (mean)
Time per request:       3.687 [ms] (mean)
Time per request:       0.037 [ms] (mean, across all concurrent requests)
Transfer rate:          115237.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.7      0     254
Processing:     0    4   0.6      4     180
Waiting:        0    4   0.6      4     180
Total:          0    4   1.8      4     254

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      4
  99%      4
 100%    254 (longest request)
----8kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /8kb
Document Length:        8192 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1506470
Failed requests:        0
Keep-Alive requests:    1506470
Total transferred:      12725152090 bytes
HTML transferred:       12341002240 bytes
Requests per second:    25107.83 [#/sec] (mean)
Time per request:       3.983 [ms] (mean)
Time per request:       0.040 [ms] (mean, across all concurrent requests)
Transfer rate:          207115.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.8      0     254
Processing:     0    4   0.6      4     169
Waiting:        0    4   0.6      4     169
Total:          0    4   1.9      4     254

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      4
  99%      4
 100%    254 (longest request)
----16kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /16kb
Document Length:        16384 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      993733
Failed requests:        0
Keep-Alive requests:    993733
Total transferred:      16535717120 bytes
HTML transferred:       16281321472 bytes
Requests per second:    16562.21 [#/sec] (mean)
Time per request:       6.038 [ms] (mean)
Time per request:       0.060 [ms] (mean, across all concurrent requests)
Transfer rate:          269135.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.2      0     257
Processing:     0    6   0.8      6     182
Waiting:        0    6   0.8      6     182
Total:          0    6   2.3      6     257

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      6
  90%      6
  95%      6
  98%      6
  99%      6
 100%    257 (longest request)
----32kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /32kb
Document Length:        32768 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      693623
Failed requests:        0
Keep-Alive requests:    693623
Total transferred:      22906205952 bytes
HTML transferred:       22728638464 bytes
Requests per second:    11560.37 [#/sec] (mean)
Time per request:       8.650 [ms] (mean)
Time per request:       0.087 [ms] (mean, across all concurrent requests)
Transfer rate:          372821.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.7      0     258
Processing:     0    9   0.9      9     183
Waiting:        0    9   0.9      9     183
Total:          0    9   2.8      9     259

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%      9
  90%      9
  95%      9
  98%      9
  99%      9
 100%    259 (longest request)
----64kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /64kb
Document Length:        65536 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      439867
Failed requests:        0
Keep-Alive requests:    439867
Total transferred:      28940169531 bytes
HTML transferred:       28827123712 bytes
Requests per second:    7331.11 [#/sec] (mean)
Time per request:       13.640 [ms] (mean)
Time per request:       0.136 [ms] (mean, across all concurrent requests)
Transfer rate:          471030.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.4      0     265
Processing:     0   14   1.1     14     187
Waiting:        0   13   1.1     13     187
Total:          0   14   3.4     14     265

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     14
  80%     14
  90%     14
  95%     14
  98%     14
  99%     14
 100%    265 (longest request)
----128kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /128kb
Document Length:        131072 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      255226
Failed requests:        0
Keep-Alive requests:    255226
Total transferred:      33518830580 bytes
HTML transferred:       33452982272 bytes
Requests per second:    4253.76 [#/sec] (mean)
Time per request:       23.509 [ms] (mean)
Time per request:       0.235 [ms] (mean, across all concurrent requests)
Transfer rate:          545553.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   4.7      0     277
Processing:     0   23   1.3     23     179
Waiting:        0   23   1.3     23     179
Total:          0   24   4.5     23     277

Percentage of the requests served within a certain time (ms)
  50%     23
  66%     23
  75%     23
  80%     23
  90%     23
  95%     24
  98%     24
  99%     24
 100%    277 (longest request)